---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheet.CutOverallWidth
source: html/95dcc8d5-1715-15f2-d3b7-dc11a6ccac58.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.CutOverallWidth Property

The sheet length after cutting has taken place.

## Syntax (C#)
```csharp
public double CutOverallWidth { get; }
```